app/views/posts/_form_show_post_and_comments_page.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
---
  <% if session[:current_user_id] != nil %>
      <h3>Logged in as: <%= User.find(session[:current_user_id]).name %></h3>

SELECT COUNT(*) FROM "votes" WHERE "votes"."post_id" = 16
---
                              new_vote_path(:post_id=>post.id) %>
                  <% if post.votes.count!=0 %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 16
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 16
---
                              new_comment_path(:post_id=>post.id, :post_question=>post.question) %>
                  <% if post.comments.count!=0 %>

SELECT COUNT(*) FROM "comment_votes" WHERE "comment_votes"."comment_id" = 22
---
                                    new_comment_vote_path(:comment_id=>comment.id) %>
                        <% if comment.comment_votes.count!=0 %>