app/views/posts/report.html.erb

       <td align="center"> <%= post.user.name %></td>
       <td align="center"> <%= post.comments.count%></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 13