app/controllers/comments_controller.rb

  def create
    @comment = Comment.new()
    @user_id = session[:current_user_id]
    @comment.reply = params[:comment][:reply]
    @comment.user_id = @user_id
    @comment.post_id = params[:comment][:post_id]

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("created_at", "post_id", "reply", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 05 Oct 2011 20:46:29 UTC +00:00], ["post_id", 15], ["reply", "my comment"], ["updated_at", Wed, 05 Oct 2011 20:46:29 UTC +00:00], ["user_id", 10]]

  def update
    @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "122467993"]]