app/controllers/comment_votes_controller.rb

def new
    comment_id = params[:comment_id]
    if session[:current_user_id]!=nil
      comment = Comment.find_by_id(comment_id)
      if comment.user_id!= session[:current_user_id] #not allowing to vote for own question
        @comment_vote = CommentVote.find_by_comment_id_and_user_id(comment_id,session[:current_user_id])
        if @comment_vote==nil
          @comment_vote = CommentVote.new
          @comment_vote.user_id = session[:current_user_id]
          @comment_vote.comment_id = comment_id
          @comment_vote.post_id = comment.post_id
          @comment_vote.save
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 1 LIMIT 1
SELECT "comment_votes".* FROM "comment_votes" WHERE "comment_votes"."comment_id" = 1 AND "comment_votes"."user_id" = 2 LIMIT 1
INSERT INTO "comment_votes" ("comment_id", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment_id", 1], ["created_at", Sat, 08 Oct 2011 01:19:00 UTC +00:00], ["post_id", 1], ["updated_at", Sat, 08 Oct 2011 01:19:00 UTC +00:00], ["user_id", 2]]