app/controllers/login_controller.rb

  def login
    session[:current_user_id] = nil
    session[:admin_user] = false
    @user = User.find_by_uname(params[:uname])
---
SELECT "users".* FROM "users" WHERE "users"."uname" = 'admin' LIMIT 1