app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (question LIKE '%admin%')
---
 def search
    @posts = Post.find(:all, :conditions => "question LIKE '%#{params[:inp]}%'")

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "18"]]
---
  def show
    @posts = Post.find(:all)

SELECT "posts".* FROM "posts"
---
  def report
    @method = params[:id]
    @posts = Post.all

INSERT INTO "posts" ("created_at", "numVotes", "question", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 05 Oct 2011 21:08:43 UTC +00:00], ["numVotes", 0], ["question", "new question"], ["updated_at", Wed, 05 Oct 2011 21:08:43 UTC +00:00], ["user_id", 10]]
---
  def create
    @post = Post.new(params[:post])
    @post.user_id = session[:current_user_id]
    @post.numVotes=0
    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "277846598"]]
UPDATE "posts" SET "user_id" = NULL, "updated_at" = '2011-10-05 05:47:30.421065' WHERE "posts"."id" = 277846598
---
  def update
    @post = Post.find(params[:id])
    @post.user_id = session[:current_user_id]
    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "19"]]
SELECT "votes".* FROM "votes" WHERE (post_id = 19)
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE (post_id = 19)
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
SELECT "comment_votes".* FROM "comment_votes" WHERE (post_id = 19)
DELETE FROM "comment_votes" WHERE "comment_votes"."id" = ?  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 19]]
---
  def destroy
    @post = Post.find(params[:id])
    vote = Vote.find( :all, :conditions => ["post_id = ?", @post.id])
    for n in 0 ... vote.size do
         Vote.destroyCascade(vote[n])
    end
    comment = Comment.find(:all, :conditions => ["post_id = ?", @post.id])
    for n in 0 ... comment.size do
             Comment.destroyCascade(comment[n])
    end
    commentvote = CommentVote.find(:all, :conditions => ["post_id = ?", @post.id])
    for n in 0 ... commentvote.size do
             CommentVote.destroyCascade(commentvote[n])
    end
    @post.destroy