app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("admin_perm", "created_at", "email", "hashed_password", "name", "salt", "uname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "15"]]
UPDATE "users" SET "salt" = '361588440.06297641369328566', "hashed_password" = '012c53e54c1b0ee45ea020b20984b2be8aaa93d01280a9760e49370cd69ab33d', "updated_at" = '2011-10-06 00:49:05.404931' WHERE "users"."id" = 15

  def search
     @user = User.find_by_uname(params[:inp])

      if @user != nil
        @posts = Post.find_all_by_user_id(@user.id)
---
SELECT "users".* FROM "users" WHERE "users"."uname" = 'sri' LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 7

  def destroy
    @user = User.find(params[:id])

    post = Post.find(:all, :conditions => ["user_id = ?", @user.id])
    for n in 0 ... post.size do
      Post.destroyCascade(post[n])
    end

    vote = Vote.find(:all, :conditions => ["user_id = ?", @user.id])
    for n in 0 ... vote.size do
      Vote.destroyCascade(vote[n])
    end
    comment = Comment.find(:all, :conditions => ["user_id = ?", @user.id])
    for n in 0 ... comment.size do
      Comment.destroyCascade(comment[n])
    end
    commentvote = CommentVote.find(:all, :conditions => ["user_id = ?", @user.id])
    for n in 0 ... commentvote.size do
      CommentVote.destroyCascade(commentvote[n])
    end

    @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "posts".* FROM "posts" WHERE (user_id = 2)
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 13]]
SELECT "votes".* FROM "votes" WHERE (user_id = 2)
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 15]]
SELECT "comments".* FROM "comments" WHERE (user_id = 2)
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]
SELECT "comment_votes".* FROM "comment_votes" WHERE (user_id = 2)
DELETE FROM "comment_votes" WHERE "comment_votes"."id" = ?  [["id", 4]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]