app/controllers/votes_controller.rb

  def new
    post_id = params[:post_id]
    if session[:current_user_id]!=nil
      post = Post.find_by_id(post_id)
      if post.user_id!= session[:current_user_id] #not allowing to vote for own question
        @vote = Vote.find_by_post_id_and_user_id(post_id, session[:current_user_id])
        if @vote==nil
          @vote = Vote.new
          @vote.user_id = session[:current_user_id]
          @vote.post_id = post.id
          post.numVotes = post.numVotes+1
          post.save
          @vote.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 20 LIMIT 1
SELECT "votes".* FROM "votes" WHERE "votes"."post_id" = 20 AND "votes"."user_id" = 17 LIMIT 1
UPDATE "posts" SET "numVotes" = 1, "updated_at" = '2011-10-06 01:19:10.728189' WHERE "posts"."id" = 20
INSERT INTO "votes" ("created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 06 Oct 2011 01:19:10 UTC +00:00], ["post_id", 20], ["updated_at", Thu, 06 Oct 2011 01:19:10 UTC +00:00], ["user_id", 17]]